Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: При изменении внешнего вида блока или элемента придется менять не только CSS-код, но и названия селекторов. Например, если цвет границы изменится с серого (grey) на красный (red), нужно будет изменить шаблоны и, вполне вероятно, JavaScript-код.
en: If the block or the element changes its look, you will have to edit not only the CSS code but also the selector names. E.g., if the border color is changed from grey to red, you will need to edit the templates, and most likely, the JavaScript code.

source: При добавлении других свойств (фона, отступов), имя перестанет соответствовать содержанию модификатора.
en: If other properties (background, margins) are added, the name of the modifier will no longer match the content.

source: Методология БЭМ рекомендует выбирать имена модификаторов, опираясь на семантику, а не визуальное оформление.
en: The BEM methodology recommends choosing names for modifiers based on semantics rather than visual representation.
